In [1]:
import numpy as np
import pickle

import psycopg2 as pg
import pandas.io.sql as psql
import pandas as pd

from typing import Union, List, Tuple

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020');

In [2]:
## zad 1
df = pd.read_sql('SELECT title, length FROM film ORDER BY length ASC', con=connection)
i = 0
df['duplicates']=df['length'].eq(df['length'].iloc[i]).head(20)
df2 = df.loc[df['duplicates']==True]
df2
## elementy takie same jak element i

                 title  length duplicates
0  Ridgemont Submarine      46       True
1            Iron Moon      46       True
2         Alien Center      46       True
3        Kwai Homeward      46       True
4     Labyrinth League      46       True

In [3]:
## zad 3
df = pd.read_sql('SELECT avg(rental_rate) FROM film ', con=connection)
df

    avg
0  2.98

In [9]:
## zad 4
df = pd.read_sql('SELECT DISTINCT film.title, category.name, category.category_id FROM film,category WHERE film_id IN (SELECT category_id FROM film_category WHERE category_id IN (SELECT category_id from category )) ', con=connection)
df['name'].value_counts()

Drama          16
Animation      16
Horror         16
Children       16
Family         16
Sports         16
Documentary    16
Action         16
Games          16
Music          16
Travel         16
Classics       16
Sci-Fi         16
Comedy         16
New            16
Foreign        16
Name: name, dtype: int64

In [ ]:
## zad 5